Tekla.Structures.Drawing.PropertyElement.PropertyElementType.BoltMarkPropertyElementTypes
The BoltMarkPropertyElementTypes class represents the available property element types for bolt marks.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.BoltMarkPropertyElementTypes.BoltLength
Returns the bolt length property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.BoltMarkPropertyElementTypes.BoltDiameter
Returns the bolt diameter property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.BoltMarkPropertyElementTypes.HoleDiameter
Returns the hole diameter property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.BoltMarkPropertyElementTypes.Material
Returns the material property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.BoltMarkPropertyElementTypes.Standard
Returns the standard property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.BoltMarkPropertyElementTypes.ShortName
Returns the short name property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.BoltMarkPropertyElementTypes.FullName
Returns the full name property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.BoltMarkPropertyElementTypes.AssemblyType
Returns the assembly type property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.BoltMarkPropertyElementTypes.NumberOfBolts
Returns the number of bolts property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.BoltMarkPropertyElementTypes.SlotLengthX
Returns the slot length in the X direction property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.BoltMarkPropertyElementTypes.SlotLengthY
Returns the slot length in the Y direction property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.BoltMarkPropertyElementTypes.SlotHeight
Returns the slot height property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.BoltMarkPropertyElementTypes.SlotLength
Returns the slot length property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.BoltMarkPropertyElementTypes.Size
Returns the size property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.BoltMarkPropertyElementTypes.Countersunk
Returns the countersunk property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.BoltMarkPropertyElementTypes.GageOfOutstandingLeg
Returns the gage of the outstanding leg property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.BoltMarkPropertyElementTypes.CenterToCenterDistance
Returns the center-to-center distance property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.BoltMarkPropertyElementTypes.HoleDepth
Returns the hole depth property element type.
Returns: The requested property element type.